In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('student.db')
cursor = conn.cursor()

In [3]:
sql_create_table = '''CREATE TABLE Students (
    Student_ID INT PRIMARY KEY,
    Name VARCHAR(100),
    Course VARCHAR(100),
    GPA FLOAT
)'''

cursor.execute(sql_create_table)

In [4]:
list_of_students = [
    (1, 'Safiyya', 'MBBS', 3.98),
    (2, 'Badaru', 'Mathematics', 3.9),
    (3, 'Hassana', 'Physics', 3.7),
    (4, 'Dauda', 'Chemistry', 3.6),
    (5, 'Abubakar', 'Biology', 3.9),
    (6, 'Faruq', 'History', 3.8),
    (7, 'Garba', 'Geography', 3.7),
    (8, 'Habiba', 'English', 3.9),
    (9, 'Idris', 'Psychology', 3.8),
    (10, 'Jamilu', 'Sociology', 3.7),
    (11, 'Kashim', 'Economics', 3.9),
    (12, 'Lawisa', 'Political Science', 3.8),
    (13, 'Maryam', 'Philosophy', 3.7),
    (14, 'Nuhu', 'Anthropology', 3.9),
    (15, 'Umar', 'Anthropology', 3.8),
    (16, 'Usman', 'Anthropology', 3.7),
    (17, 'Farida', 'Anthropology', 3.9),
    (18, 'Kabir', 'Anthropology', 3.8),
    (19, 'Rabiu', 'Anthropology', 3.7),
    (20, 'Salihu', 'Anthropology', 3.9),
    (21, 'Tom', 'Anthropology', 3.8),
    (22, 'Umma', 'Anthropology', 3.7),
    (23, 'Basira', 'Anthropology', 3.9),
    (24, 'Wasila', 'Anthropology', 3.8),
    (25, 'Nazir', 'Anthropology', 3.7),
    (26, 'Yunusa', 'Anthropology', 3.9),
    (27, 'Zainab', 'Anthropology', 3.8),
    (28, 'Adam', 'Anthropology', 3.7),
    (29, 'Aslamiyya', 'Anthropology', 3.9),
    (30, 'Sadiq', 'Anthropology', 3.8),
    (31, 'Aliyu', 'Anthropology', 3.7),
    (32, 'Abdullahi', 'Anthropology', 3.9),
    (33, 'Sadiya', 'Anthropology', 3.8),
    (34, 'Halima', 'Anthropology', 3.7),
    (35, 'Hannatu', 'Anthropology', 3.9)]

In [5]:
# Insert data into the Students table
for student in list_of_students:
    Student_ID = student[0]
    Name = student[1]
    Course = student[2]
    GPA = student[3]

    cursor.execute("INSERT INTO Students (Student_ID, Name, Course, GPA) VALUES (?, ?, ?, ?)", (Student_ID, Name, Course, GPA))
conn.commit()

In [6]:
# fetch all data from the Students table
cursor.execute("SELECT * FROM Students")

# store the results in a variable
results = cursor.fetchall()

# print the results
for result in results:
    print(result)

(1, 'Safiyya', 'MBBS', 3.98)
(2, 'Badaru', 'Mathematics', 3.9)
(3, 'Hassana', 'Physics', 3.7)
(4, 'Dauda', 'Chemistry', 3.6)
(5, 'Abubakar', 'Biology', 3.9)
(6, 'Faruq', 'History', 3.8)
(7, 'Garba', 'Geography', 3.7)
(8, 'Habiba', 'English', 3.9)
(9, 'Idris', 'Psychology', 3.8)
(10, 'Jamilu', 'Sociology', 3.7)
(11, 'Kashim', 'Economics', 3.9)
(12, 'Lawisa', 'Political Science', 3.8)
(13, 'Maryam', 'Philosophy', 3.7)
(14, 'Nuhu', 'Anthropology', 3.9)
(15, 'Umar', 'Anthropology', 3.8)
(16, 'Usman', 'Anthropology', 3.7)
(17, 'Farida', 'Anthropology', 3.9)
(18, 'Kabir', 'Anthropology', 3.8)
(19, 'Rabiu', 'Anthropology', 3.7)
(20, 'Salihu', 'Anthropology', 3.9)
(21, 'Tom', 'Anthropology', 3.8)
(22, 'Umma', 'Anthropology', 3.7)
(23, 'Basira', 'Anthropology', 3.9)
(24, 'Wasila', 'Anthropology', 3.8)
(25, 'Nazir', 'Anthropology', 3.7)
(26, 'Yunusa', 'Anthropology', 3.9)
(27, 'Zainab', 'Anthropology', 3.8)
(28, 'Adam', 'Anthropology', 3.7)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(30, 'Sadiq', 'Anthropology', 3.8)
(31, 'Aliyu', 'Anthropology', 3.7)
(32, 'Abdullahi', 'Anthropology', 3.9)
(33, 'Sadiya', 'Anthropology', 3.8)
(34, 'Halima', 'Anthropology', 3.7)
(35, 'Hannatu', 'Anthropology', 3.9)

Slicing

In [7]:
cursor.execute("SELECT * FROM Students WHERE GPA > 3.8")
students_with_high_gpa = cursor.fetchall()
print("\nStudents with GPA greater than 3.8:")
for student in students_with_high_gpa:
    print(student)

Students with GPA greater than 3.8:
(1, 'Safiyya', 'MBBS', 3.98)
(2, 'Badaru', 'Mathematics', 3.9)
(5, 'Abubakar', 'Biology', 3.9)
(8, 'Habiba', 'English', 3.9)
(11, 'Kashim', 'Economics', 3.9)
(14, 'Nuhu', 'Anthropology', 3.9)
(17, 'Farida', 'Anthropology', 3.9)
(20, 'Salihu', 'Anthropology', 3.9)
(23, 'Basira', 'Anthropology', 3.9)
(26, 'Yunusa', 'Anthropology', 3.9)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(32, 'Abdullahi', 'Anthropology', 3.9)
(35, 'Hannatu', 'Anthropology', 3.9)

In [8]:
cursor.execute("SELECT * FROM Students WHERE Course = 'Anthropology'")
anthropology_students = cursor.fetchall()
print("\nAnthropology Students:")
for student in anthropology_students:
    print(student)

Anthropology Students:
(14, 'Nuhu', 'Anthropology', 3.9)
(15, 'Umar', 'Anthropology', 3.8)
(16, 'Usman', 'Anthropology', 3.7)
(17, 'Farida', 'Anthropology', 3.9)
(18, 'Kabir', 'Anthropology', 3.8)
(19, 'Rabiu', 'Anthropology', 3.7)
(20, 'Salihu', 'Anthropology', 3.9)
(21, 'Tom', 'Anthropology', 3.8)
(22, 'Umma', 'Anthropology', 3.7)
(23, 'Basira', 'Anthropology', 3.9)
(24, 'Wasila', 'Anthropology', 3.8)
(25, 'Nazir', 'Anthropology', 3.7)
(26, 'Yunusa', 'Anthropology', 3.9)
(27, 'Zainab', 'Anthropology', 3.8)
(28, 'Adam', 'Anthropology', 3.7)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(30, 'Sadiq', 'Anthropology', 3.8)
(31, 'Aliyu', 'Anthropology', 3.7)
(32, 'Abdullahi', 'Anthropology', 3.9)
(33, 'Sadiya', 'Anthropology', 3.8)
(34, 'Halima', 'Anthropology', 3.7)
(35, 'Hannatu', 'Anthropology', 3.9)

Antropology and GPA > 3.8

In [9]:
cursor.execute("SELECT * FROM Students WHERE Course = 'Anthropology' AND GPA > 3.8")
anthropology_students_High_GPA = cursor.fetchall()
print("\nAnthropology Students:")
for student_GPA in anthropology_students_High_GPA:
    print(student_GPA)

Anthropology Students:
(14, 'Nuhu', 'Anthropology', 3.9)
(17, 'Farida', 'Anthropology', 3.9)
(20, 'Salihu', 'Anthropology', 3.9)
(23, 'Basira', 'Anthropology', 3.9)
(26, 'Yunusa', 'Anthropology', 3.9)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(32, 'Abdullahi', 'Anthropology', 3.9)
(35, 'Hannatu', 'Anthropology', 3.9)

Updating a record

In [10]:
# Insert a new student record
new_student = (36, 'Nasrin', 'Computer Science', 3.95)
cursor.execute("INSERT INTO Students (Student_ID, Name, Course, GPA) VALUES (?, ?, ?, ?)", new_student)
conn.commit()

print("\nAfter inserting a new student:")
cursor.execute("SELECT * FROM Students")
results = cursor.fetchall()
for result in results:
    print(result)

After inserting a new student:
(1, 'Safiyya', 'MBBS', 3.98)
(2, 'Badaru', 'Mathematics', 3.9)
(3, 'Hassana', 'Physics', 3.7)
(4, 'Dauda', 'Chemistry', 3.6)
(5, 'Abubakar', 'Biology', 3.9)
(6, 'Faruq', 'History', 3.8)
(7, 'Garba', 'Geography', 3.7)
(8, 'Habiba', 'English', 3.9)
(9, 'Idris', 'Psychology', 3.8)
(10, 'Jamilu', 'Sociology', 3.7)
(11, 'Kashim', 'Economics', 3.9)
(12, 'Lawisa', 'Political Science', 3.8)
(13, 'Maryam', 'Philosophy', 3.7)
(14, 'Nuhu', 'Anthropology', 3.9)
(15, 'Umar', 'Anthropology', 3.8)
(16, 'Usman', 'Anthropology', 3.7)
(17, 'Farida', 'Anthropology', 3.9)
(18, 'Kabir', 'Anthropology', 3.8)
(19, 'Rabiu', 'Anthropology', 3.7)
(20, 'Salihu', 'Anthropology', 3.9)
(21, 'Tom', 'Anthropology', 3.8)
(22, 'Umma', 'Anthropology', 3.7)
(23, 'Basira', 'Anthropology', 3.9)
(24, 'Wasila', 'Anthropology', 3.8)
(25, 'Nazir', 'Anthropology', 3.7)
(26, 'Yunusa', 'Anthropology', 3.9)
(27, 'Zainab', 'Anthropology', 3.8)
(28, 'Adam', 'Anthropology', 3.7)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(30, 'Sadiq', 'Anthropology', 3.8)
(31, 'Aliyu', 'Anthropology', 3.7)
(32, 'Abdullahi', 'Anthropology', 3.9)
(33, 'Sadiya', 'Anthropology', 3.8)
(34, 'Halima', 'Anthropology', 3.7)
(35, 'Hannatu', 'Anthropology', 3.9)
(36, 'Nasrin', 'Computer Science', 3.95)

Delete an Entry

In [11]:
# Delete a student record
cursor.execute("DELETE FROM Students WHERE Student_ID = 10")
conn.commit()

# Print after deletion
print("\nAfter deleting student with ID 10:")
cursor.execute("SELECT * FROM Students")
results = cursor.fetchall()
for result in results:
    print(result)

After deleting student with ID 10:
(1, 'Safiyya', 'MBBS', 3.98)
(2, 'Badaru', 'Mathematics', 3.9)
(3, 'Hassana', 'Physics', 3.7)
(4, 'Dauda', 'Chemistry', 3.6)
(5, 'Abubakar', 'Biology', 3.9)
(6, 'Faruq', 'History', 3.8)
(7, 'Garba', 'Geography', 3.7)
(8, 'Habiba', 'English', 3.9)
(9, 'Idris', 'Psychology', 3.8)
(11, 'Kashim', 'Economics', 3.9)
(12, 'Lawisa', 'Political Science', 3.8)
(13, 'Maryam', 'Philosophy', 3.7)
(14, 'Nuhu', 'Anthropology', 3.9)
(15, 'Umar', 'Anthropology', 3.8)
(16, 'Usman', 'Anthropology', 3.7)
(17, 'Farida', 'Anthropology', 3.9)
(18, 'Kabir', 'Anthropology', 3.8)
(19, 'Rabiu', 'Anthropology', 3.7)
(20, 'Salihu', 'Anthropology', 3.9)
(21, 'Tom', 'Anthropology', 3.8)
(22, 'Umma', 'Anthropology', 3.7)
(23, 'Basira', 'Anthropology', 3.9)
(24, 'Wasila', 'Anthropology', 3.8)
(25, 'Nazir', 'Anthropology', 3.7)
(26, 'Yunusa', 'Anthropology', 3.9)
(27, 'Zainab', 'Anthropology', 3.8)
(28, 'Adam', 'Anthropology', 3.7)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(30, 'Sadiq', 'Anthropology', 3.8)
(31, 'Aliyu', 'Anthropology', 3.7)
(32, 'Abdullahi', 'Anthropology', 3.9)
(33, 'Sadiya', 'Anthropology', 3.8)
(34, 'Halima', 'Anthropology', 3.7)
(35, 'Hannatu', 'Anthropology', 3.9)
(36, 'Nasrin', 'Computer Science', 3.95)

In [12]:
# Update a student's GPA
cursor.execute("UPDATE Students SET GPA = 4.0 WHERE Student_ID = 1")
conn.commit()

# Print after update
print("\nAfter updating GPA for student with ID 1:")
cursor.execute("SELECT * FROM Students")
results = cursor.fetchall()
for result in results:
    print(result)

After updating GPA for student with ID 1:
(1, 'Safiyya', 'MBBS', 4.0)
(2, 'Badaru', 'Mathematics', 3.9)
(3, 'Hassana', 'Physics', 3.7)
(4, 'Dauda', 'Chemistry', 3.6)
(5, 'Abubakar', 'Biology', 3.9)
(6, 'Faruq', 'History', 3.8)
(7, 'Garba', 'Geography', 3.7)
(8, 'Habiba', 'English', 3.9)
(9, 'Idris', 'Psychology', 3.8)
(11, 'Kashim', 'Economics', 3.9)
(12, 'Lawisa', 'Political Science', 3.8)
(13, 'Maryam', 'Philosophy', 3.7)
(14, 'Nuhu', 'Anthropology', 3.9)
(15, 'Umar', 'Anthropology', 3.8)
(16, 'Usman', 'Anthropology', 3.7)
(17, 'Farida', 'Anthropology', 3.9)
(18, 'Kabir', 'Anthropology', 3.8)
(19, 'Rabiu', 'Anthropology', 3.7)
(20, 'Salihu', 'Anthropology', 3.9)
(21, 'Tom', 'Anthropology', 3.8)
(22, 'Umma', 'Anthropology', 3.7)
(23, 'Basira', 'Anthropology', 3.9)
(24, 'Wasila', 'Anthropology', 3.8)
(25, 'Nazir', 'Anthropology', 3.7)
(26, 'Yunusa', 'Anthropology', 3.9)
(27, 'Zainab', 'Anthropology', 3.8)
(28, 'Adam', 'Anthropology', 3.7)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(30, 'Sadiq', 'Anthropology', 3.8)
(31, 'Aliyu', 'Anthropology', 3.7)
(32, 'Abdullahi', 'Anthropology', 3.9)
(33, 'Sadiya', 'Anthropology', 3.8)
(34, 'Halima', 'Anthropology', 3.7)
(35, 'Hannatu', 'Anthropology', 3.9)
(36, 'Nasrin', 'Computer Science', 3.95)

In [13]:
# Update a student's name
cursor.execute("UPDATE Students SET Name = 'Safiyya Shamsuddeen' WHERE Student_ID = 1")
# Print after update
print("\nAfter updating name for student with ID 1:")
cursor.execute("SELECT * FROM Students")
results = cursor.fetchall()
for result in results:
    print(result)  # Print only the Name field

After updating name for student with ID 1:
(1, 'Safiyya Shamsuddeen', 'MBBS', 4.0)
(2, 'Badaru', 'Mathematics', 3.9)
(3, 'Hassana', 'Physics', 3.7)
(4, 'Dauda', 'Chemistry', 3.6)
(5, 'Abubakar', 'Biology', 3.9)
(6, 'Faruq', 'History', 3.8)
(7, 'Garba', 'Geography', 3.7)
(8, 'Habiba', 'English', 3.9)
(9, 'Idris', 'Psychology', 3.8)
(11, 'Kashim', 'Economics', 3.9)
(12, 'Lawisa', 'Political Science', 3.8)
(13, 'Maryam', 'Philosophy', 3.7)
(14, 'Nuhu', 'Anthropology', 3.9)
(15, 'Umar', 'Anthropology', 3.8)
(16, 'Usman', 'Anthropology', 3.7)
(17, 'Farida', 'Anthropology', 3.9)
(18, 'Kabir', 'Anthropology', 3.8)
(19, 'Rabiu', 'Anthropology', 3.7)
(20, 'Salihu', 'Anthropology', 3.9)
(21, 'Tom', 'Anthropology', 3.8)
(22, 'Umma', 'Anthropology', 3.7)
(23, 'Basira', 'Anthropology', 3.9)
(24, 'Wasila', 'Anthropology', 3.8)
(25, 'Nazir', 'Anthropology', 3.7)
(26, 'Yunusa', 'Anthropology', 3.9)
(27, 'Zainab', 'Anthropology', 3.8)
(28, 'Adam', 'Anthropology', 3.7)
(29, 'Aslamiyya', 'Anthropology', 3.9)
(30, 'Sadiq', 'Anthropology', 3.8)
(31, 'Aliyu', 'Anthropology', 3.7)
(32, 'Abdullahi', 'Anthropology', 3.9)
(33, 'Sadiya', 'Anthropology', 3.8)
(34, 'Halima', 'Anthropology', 3.7)
(35, 'Hannatu', 'Anthropology', 3.9)
(36, 'Nasrin', 'Computer Science', 3.95)

In [14]:
avg_gpa =cursor.execute("SELECT AVG(GPA) FROM students")
avg_gpa.fetchone()[0]

3.81

In [15]:
course_antropology = cursor.execute("SELECT * FROM Students WHERE Course = 'Anthropology'")
course_antropology.fetchall()

[(14, 'Nuhu', 'Anthropology', 3.9),
 (15, 'Umar', 'Anthropology', 3.8),
 (16, 'Usman', 'Anthropology', 3.7),
 (17, 'Farida', 'Anthropology', 3.9),
 (18, 'Kabir', 'Anthropology', 3.8),
 (19, 'Rabiu', 'Anthropology', 3.7),
 (20, 'Salihu', 'Anthropology', 3.9),
 (21, 'Tom', 'Anthropology', 3.8),
 (22, 'Umma', 'Anthropology', 3.7),
 (23, 'Basira', 'Anthropology', 3.9),
 (24, 'Wasila', 'Anthropology', 3.8),
 (25, 'Nazir', 'Anthropology', 3.7),
 (26, 'Yunusa', 'Anthropology', 3.9),
 (27, 'Zainab', 'Anthropology', 3.8),
 (28, 'Adam', 'Anthropology', 3.7),
 (29, 'Aslamiyya', 'Anthropology', 3.9),
 (30, 'Sadiq', 'Anthropology', 3.8),
 (31, 'Aliyu', 'Anthropology', 3.7),
 (32, 'Abdullahi', 'Anthropology', 3.9),
 (33, 'Sadiya', 'Anthropology', 3.8),
 (34, 'Halima', 'Anthropology', 3.7),
 (35, 'Hannatu', 'Anthropology', 3.9)]

In [16]:
sort_by_gpa = cursor.execute("SELECT * FROM Students ORDER BY GPA DESC")
sort_by_gpa.fetchall()

[(1, 'Safiyya Shamsuddeen', 'MBBS', 4.0),
 (36, 'Nasrin', 'Computer Science', 3.95),
 (2, 'Badaru', 'Mathematics', 3.9),
 (5, 'Abubakar', 'Biology', 3.9),
 (8, 'Habiba', 'English', 3.9),
 (11, 'Kashim', 'Economics', 3.9),
 (14, 'Nuhu', 'Anthropology', 3.9),
 (17, 'Farida', 'Anthropology', 3.9),
 (20, 'Salihu', 'Anthropology', 3.9),
 (23, 'Basira', 'Anthropology', 3.9),
 (26, 'Yunusa', 'Anthropology', 3.9),
 (29, 'Aslamiyya', 'Anthropology', 3.9),
 (32, 'Abdullahi', 'Anthropology', 3.9),
 (35, 'Hannatu', 'Anthropology', 3.9),
 (6, 'Faruq', 'History', 3.8),
 (9, 'Idris', 'Psychology', 3.8),
 (12, 'Lawisa', 'Political Science', 3.8),
 (15, 'Umar', 'Anthropology', 3.8),
 (18, 'Kabir', 'Anthropology', 3.8),
 (21, 'Tom', 'Anthropology', 3.8),
 (24, 'Wasila', 'Anthropology', 3.8),
 (27, 'Zainab', 'Anthropology', 3.8),
 (30, 'Sadiq', 'Anthropology', 3.8),
 (33, 'Sadiya', 'Anthropology', 3.8),
 (3, 'Hassana', 'Physics', 3.7),
 (7, 'Garba', 'Geography', 3.7),
 (13, 'Maryam', 'Philosophy', 3.7),
 (16, 'Usman', 'Anthropology', 3.7),
 (19, 'Rabiu', 'Anthropology', 3.7),
 (22, 'Umma', 'Anthropology', 3.7),
 (25, 'Nazir', 'Anthropology', 3.7),
 (28, 'Adam', 'Anthropology', 3.7),
 (31, 'Aliyu', 'Anthropology', 3.7),
 (34, 'Halima', 'Anthropology', 3.7),
 (4, 'Dauda', 'Chemistry', 3.6)]

In [17]:
limit_5 = cursor.execute("SELECT * FROM Students LIMIT 5")
limit_5.fetchall()

[(1, 'Safiyya Shamsuddeen', 'MBBS', 4.0),
 (2, 'Badaru', 'Mathematics', 3.9),
 (3, 'Hassana', 'Physics', 3.7),
 (4, 'Dauda', 'Chemistry', 3.6),
 (5, 'Abubakar', 'Biology', 3.9)]

In [18]:
group_by_course = cursor.execute("SELECT Course, AVG(GPA) as Average_GPA FROM Students GROUP BY Course")
group_by_course.fetchall()

[('Anthropology', 3.8045454545454547),
 ('Biology', 3.9),
 ('Chemistry', 3.6),
 ('Computer Science', 3.95),
 ('Economics', 3.9),
 ('English', 3.9),
 ('Geography', 3.7),
 ('History', 3.8),
 ('MBBS', 4.0),
 ('Mathematics', 3.9),
 ('Philosophy', 3.7),
 ('Physics', 3.7),
 ('Political Science', 3.8),
 ('Psychology', 3.8)]

In [19]:
round_gpa = cursor.execute("SELECT ROUND(AVG(GPA), 2) FROM Students")  # 
round_gpa.fetchall()  # Round to 2 decimal places

[(3.81,)]

In [20]:
# Bringing it all together
cursor.execute("""SELECT Course, COUNT(*) as Number_of_Students, ROUND(AVG(GPA), 2) as Average_GPA
                  FROM Students
                  GROUP BY Course
                  ORDER BY Average_GPA DESC
                  LIMIT 5""")
results = cursor.fetchall()
results

[('MBBS', 1, 4.0),
 ('Computer Science', 1, 3.95),
 ('Mathematics', 1, 3.9),
 ('English', 1, 3.9),
 ('Economics', 1, 3.9)]